#+OPTIONS: num:nil
*** With an output format

#+BEGIN_SRC sh :results output :exports both
./pasinks -format "%Name / %ActivePortDescription: %VolumePercent (%StateString)"
#+END_SRC

#+RESULTS:
: alsa_output.usb-Generic_USB_Audio_200901010001-00.HiFi__hw_Dock_1__sink / Line Out: 85% (Suspended)
: alsa_output.usb-Generic_USB_Audio_200901010001-00.HiFi__hw_Dock_0__sink / Headphone: 80% (Suspended)
: alsa_output.pci-0000_00_1f.3.analog-stereo / Speakers: 28% (Suspended)

*** Filter by state

#+BEGIN_SRC sh :results output :exports both
./pasinks -running -format "%VolumePercent"
#+END_SRC

#+RESULTS:
: 85%

